In [1]:
import mysql.connector
import pandas as pd

In [2]:
config = {
    'user': 'user',
    'password': 'password',
    'host': 'db',
    'port': '3306',
    'database': 'AA_AUDIT',
}

connection = mysql.connector.connect(**config)

In [3]:
cursor = connection.cursor(buffered=True)

In [4]:
beams  = pd.read_sql("select * from beams", connection)
cases = pd.read_sql("select * from cases", connection)
ct_models = pd.read_sql("select * from ct_models", connection)
energy_level = pd.read_sql("select * from energy_level", connection)
facilities = pd.read_sql("select * from facilities", connection)
facilities_has_linacs = pd.read_sql("select * from facilities_has_linacs", connection)
facility_operator = pd.read_sql("select * from facility_operator", connection)
linac_models = pd.read_sql("select * from linac_models", connection)
phantoms = pd.read_sql("select * from phantoms", connection)
planning_systems = pd.read_sql("select * from planning_systems", connection)
points = pd.read_sql("select * from points", connection)
trs_398_method = pd.read_sql("select * from trs_398_method", connection)

In [5]:
trs_398_method

   method_id            description
0          1  Daily Output (cGy/MU)
1          2                   None

In [6]:
phantoms

   phantom_id         name
0           1          Max
1           2     Red Anne
2           3  Yellow Anne

In [7]:
planning_systems

   ps_id manufacturer      name version
0      0          RAV       Eth    None
1      1          RAV       Sun    None
2      2          IHP  Mountain    None
3      3          LEK       Sea    None
4      4          LEK      Land    None
5      5          Bra       iPL    None
6      6          URA       Pre    None
7      7          URA    Animal    None

In [8]:
points

    point position
0       1     None
1       3     None
2       5     None
3       8     None
4      10     None
5      11     None
6      12     None
7      13     None
8      14     None
9      15     None
10     16     None
11     17     None
12     18     None
13     19     None
14     20     None

In [9]:
facility_operator

   operator_id         name registration_number public_private
0            1   Operator A              123456         public
1            2  Operator B               234567        private
2            3   Operator C              789456         public
3            4   Operator D              591357           None

In [10]:
linac_models

   linac_model_id manufacturer        model
0               1       Elekta       Axesse
1               2      Accuray   CyberKnife
2               3      Accuray  Tomotherapy
3               4       Varian      Halcyon
4               5      Neusoft      NMSR600

In [11]:
ct_models

   ct_model_id manufacturer               model
0            1           GE              750 HD
1            2           GE          Optima 660
2            3           GE       LightSpeed 16
3            4      Philips                 iCT
4            5      Philips               MX 16
5            6      Siemens          Senstation
6            7      Siemens            Scope 16
7            8      Toshiba           Prime 160
8            9      Toshiba          Aquilion 8
9           10           GE  BrightSpeed Edge 8

In [12]:
cases

   case_id description
0        1         Foo
1        5         Bar
2        6         Baz
3        7         Qux
4        8       Corge

In [13]:
ct_models

   ct_model_id manufacturer               model
0            1           GE              750 HD
1            2           GE          Optima 660
2            3           GE       LightSpeed 16
3            4      Philips                 iCT
4            5      Philips               MX 16
5            6      Siemens          Senstation
6            7      Siemens            Scope 16
7            8      Toshiba           Prime 160
8            9      Toshiba          Aquilion 8
9           10           GE  BrightSpeed Edge 8